_sdaiAttributeDomain(Sdai_instS*)
\details
Retrieves the primitive type (domain) of a specified attribute.
\param attribute [in] An attribute.
\returns A primitive type that represents the current attribute domain.
\remarks
The functions starting from _sdai are ODA extensions over the standard.
Possible error codes:
* sdaiEI_NVLD - Entity instance invalid.
\code
SdaiEntity ifcPostalAddress = sdaiGetEntity(pModel, "ifcpostaladdress");
auto interferencetypeAttr = sdaiGetAttrDefinition(ifcPostalAddress, "internallocation");
SdaiPrimitiveType type = _sdaiAttributeDomain(interferencetypeAttr); //sdaiSTRING